# Olympic medalists data

In [2]:
import pandas as pd

In [3]:
medals = pd.read_csv("all_medalists.csv")

In [4]:
medals.sample(5)

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
27834,Beijing,2008,Basketball,Basketball,"HOWARD, Dwight",USA,Men,basketball,M,Gold
7822,London,1948,Rowing,Rowing,"BONI, Bruno",ITA,Men,coxless pair (2-),M,Bronze
26994,Athens,2004,Volleyball,Beach volley.,"REGO, Emanuel",BRA,Men,beach volleyball,M,Gold
21195,Barcelona,1992,Volleyball,Volleyball,"IZQUIERDO, Lilia",CUB,Women,volleyball,W,Gold
21230,Barcelona,1992,Weightlifting,Weightlifting,"YOTOV, Yoto Vassilev",BUL,Men,"60 - 67.5kg, total (lightweight)",M,Silver

## Using .value_counts() for ranking
For this exercise, you will use the pandas Series method .value_counts() to determine the top 15 countries ranked by total number of medals.

Notice that .value_counts() sorts by values by default. The result is returned as a Series of counts indexed by unique entries from the original Series with values (counts) ranked in descending order.

The DataFrame has been pre-loaded for you as medals.

- Extract the 'NOC' column from the DataFrame medals and assign the result to country_names. Notice that this Series has repeated entries for every medal (of any type) a country has won in any Edition of the Olympics.
- Create a Series medal_counts by applying .value_counts() to the Series country_names.
- Print the top 15 countries ranked by total number of medals won. This has been done for you, so hit 'Submit Answer' to see the result.

In [5]:
# Select the 'NOC' column of medals: country_names
country_names = medals["NOC"]

In [6]:
# Count the number of medals won by each country: medal_counts
medal_counts = country_names.value_counts()

In [7]:
print(medal_counts.head(15))

USA    4335
URS    2049
GBR    1594
FRA    1314
ITA    1228
GER    1211
AUS    1075
HUN    1053
SWE    1021
GDR     825
NED     782
JPN     704
CHN     679
RUS     638
ROU     624
Name: NOC, dtype: int64

## Using .pivot_table() to count medals by type
Rather than ranking countries by total medals won and showing that list, you may want to see a bit more detail. You can use a pivot table to compute how many separate bronze, silver and gold medals each country won. That pivot table can then be used to repeat the previous computation to rank by total medals won.

In this exercise, you will use .pivot_table() first to aggregate the total medals by type. Then, you can use .sum() along the columns of the pivot table to produce a new column. When the modified pivot table is sorted by the total medals column, you can display the results from the last exercise with a bit more detail.

- Construct a pivot table counted from the DataFrame medals, aggregating by 'count'. Use 'NOC' as the index, 'Athlete' for the values, and 'Medal' for the columns.
- Modify the DataFrame counted by adding a column counted['totals']. The new column 'totals' should contain the result of taking the sum along the columns (i.e., use .sum(axis='columns')).
- Overwrite the DataFrame counted by sorting it with the .sort_values() method. Specify the keyword argument ascending=False.
- Print the first 15 rows of counted using .head(15). This has been done for you, so hit 'Submit Answer' to see the result.

In [8]:
# Construct the pivot table: counted
counted = medals.pivot_table(index="NOC", values="Athlete", columns="Medal", aggfunc="count")

In [9]:
counted

Medal  Bronze   Gold  Silver
NOC
AFG       1.0    NaN     NaN
AHO       NaN    NaN     1.0
ALG       8.0    4.0     2.0
ANZ       5.0   20.0     4.0
ARG      88.0   68.0    83.0
..        ...    ...     ...
VIE       NaN    NaN     2.0
YUG     118.0  143.0   174.0
ZAM       1.0    NaN     1.0
ZIM       1.0   18.0     4.0
ZZX      10.0   23.0    15.0

[138 rows x 3 columns]

In [10]:
# Create the new column: counted['totals']
counted['totals'] = counted.sum(axis="columns")

In [11]:
# Sort counted by the 'totals' column
counted = counted.sort_values("totals", ascending=False)

In [12]:
#counted.to_excel("pivot_medals.xlsx")

In [13]:
# Print the top 15 rows of counted
print(counted.head(15))

Medal  Bronze    Gold  Silver  totals
NOC
USA    1052.0  2088.0  1195.0  4335.0
URS     584.0   838.0   627.0  2049.0
GBR     505.0   498.0   591.0  1594.0
FRA     475.0   378.0   461.0  1314.0
ITA     374.0   460.0   394.0  1228.0
GER     454.0   407.0   350.0  1211.0
AUS     413.0   293.0   369.0  1075.0
HUN     345.0   400.0   308.0  1053.0
SWE     325.0   347.0   349.0  1021.0
GDR     225.0   329.0   271.0   825.0
NED     320.0   212.0   250.0   782.0
JPN     270.0   206.0   228.0   704.0
CHN     193.0   234.0   252.0   679.0
RUS     240.0   192.0   206.0   638.0
ROU     282.0   155.0   187.0   624.0

# Understanding the column labels

## Applying .drop_duplicates()
What could be the difference between the 'Event_gender' and 'Gender' columns? You should be able to evaluate your guess by looking at the unique values of the pairs (Event_gender, Gender) in the data. In particular, you should not see something like (Event_gender='M', Gender='Women'). However, you will see that, strangely enough, there is an observation with (Event_gender='W', Gender='Men').

The duplicates can be dropped using the .drop_duplicates() method, leaving behind the unique observations. The DataFrame has been loaded as medals.

- Select the columns 'Event_gender' and 'Gender'.
- Create a dataframe ev_gen_uniques containing the unique pairs contained in ev_gen.
- Print ev_gen_uniques. This has been done for you, so hit 'Submit Answer' to see the result.

In [14]:
# Select columns: ev_gen
ev_gen = medals[["Event_gender", "Gender"]]

In [15]:
ev_gen.head()

  Event_gender Gender
0            M    Men
1            M    Men
2            M    Men
3            M    Men
4            M    Men

In [16]:
# Drop duplicate pairs: ev_gen_uniques
ev_gen_uniques = ev_gen.drop_duplicates()

# Print ev_gen_uniques
print(ev_gen_uniques)

      Event_gender Gender
0                M    Men
348              X    Men
416              W  Women
639              X  Women
23675            W    Men

## Finding possible errors with .groupby()
You will now use .groupby() to continue your exploration. Your job is to group by 'Event_gender' and 'Gender' and count the rows.

You will see that there is only one suspicious row: This is likely a data error.

The DataFrame is available to you as medals

- Group medals by 'Event_gender' and 'Gender'.
- Create a medal_count_by_gender DataFrame with a group count using the .count() method.
- Print medal_count_by_gender. This has been done for you, so hit 'Submit Answer' to view the result.

In [18]:
# Group medals by the two columns: medals_by_gender
medals_by_gender = medals.groupby(["Event_gender", "Gender"])

In [20]:
# Create a DataFrame with a group count: medal_count_by_gender
medal_count_by_gender = medals_by_gender.count()

In [21]:
# Print medal_count_by_gender
medal_count_by_gender

                      City  Edition  Sport  Discipline  Athlete    NOC  Event  \
Event_gender Gender
M            Men     20067    20067  20067       20067    20067  20067  20067
W            Men         1        1      1           1        1      1      1
             Women    7277     7277   7277        7277     7277   7277   7277
X            Men      1653     1653   1653        1653     1653   1653   1653
             Women     218      218    218         218      218    218    218

                     Medal
Event_gender Gender
M            Men     20067
W            Men         1
             Women    7277
X            Men      1653
             Women     218

## Locating suspicious data
You will now inspect the suspect record by locating the offending row.

You will see that, according to the data, Joyce Chepchumba was a man that won a medal in a women's event. That is a data error as you can confirm with a web search.

- Create a Boolean Series with a condition that captures the only row that has medals.Event_gender == 'W' and medals.Gender == 'Men'. Be sure to use the & operator.
- Use the Boolean Series to create a DataFrame called suspect with the suspicious row.
- Print suspect. This has been done for you, so hit 'Submit Answer' to see the result.

In [23]:
# Create the Boolean Series: sus
sus = (medals.Event_gender =="W") & (medals.Gender == "Men")

In [24]:
sus

0        False
1        False
2        False
3        False
4        False
         ...
29211    False
29212    False
29213    False
29214    False
29215    False
Length: 29216, dtype: bool

In [25]:
# Create a DataFrame with the suspicious row: suspect
suspect = medals[sus]

In [26]:
# Print suspect
suspect

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
23675,Sydney,2000,Athletics,Athletics,"CHEPCHUMBA, Joyce",KEN,Men,marathon,W,Bronze

# Finding indexes with max or min values
df.smthing.idxmax() will return the index of the max. row

df.smthing.idxmax(axis="column) will returb the index of a column that contains max value

df.smthing.idxmin() will return the index of the min

df.smthing.idxmax(axis="column) will returb the index of a column that contains min value

## Using .nunique() to rank by distinct sports
You may want to know which countries won medals in the most distinct sports. The .nunique() method is the principal aggregation here. Given a categorical Series S, S.nunique() returns the number of distinct categories.

- Group medals by 'NOC'.
- Compute the number of distinct sports in which each country won medals. To do this, select the 'Sport' column from country_grouped and apply .nunique().
- Sort Nsports in descending order with .sort_values() and ascending=False.
- Print the first 15 rows of Nsports. This has been done for you, so hit 'Submit Answer' to see the result.

In [28]:
# Group medals by 'NOC': country_grouped
country_grouped = medals.groupby("NOC")

In [29]:
# Compute the number of distinct sports in which each country won medals: Nsports
Nsports = country_grouped["Sport"].nunique()

In [30]:
# Sort the values of Nsports in descending order
Nsports = Nsports.sort_values(ascending=False)

In [31]:
# Print the top 15 rows of Nsports
print(Nsports.head(15))

NOC
USA    34
GBR    31
FRA    28
GER    26
CHN    24
AUS    22
ESP    22
CAN    22
SWE    21
URS    21
ITA    21
NED    20
RUS    20
JPN    20
DEN    19
Name: Sport, dtype: int64

## Counting USA vs. USSR Cold War Olympic Sports
The Olympic competitions between 1952 and 1988 took place during the height of the Cold War between the United States of America (USA) & the Union of Soviet Socialist Republics (USSR). Your goal in this exercise is to aggregate the number of distinct sports in which the USA and the USSR won medals during the Cold War years.

The construction is mostly the same as in the preceding exercise. There is an additional filtering stage beforehand in which you reduce the original DataFrame medals by extracting data from the Cold War period that applies only to the US or to the USSR. The relevant country codes in the DataFrame, which has been pre-loaded as medals, are 'USA' & 'URS'.

- Using medals, create a Boolean Series called during_cold_war that is True when 'Edition' is >= 1952 and <= 1988.
- Using medals, create a Boolean Series called is_usa_urs that is True when 'NOC' is either 'USA' or 'URS'.
- Filter the medals DataFrame using during_cold_war and is_usa_urs to create a new DataFrame called cold_war_medals.
- Group cold_war_medals by 'NOC'.
- Create a Series Nsports from country_grouped using indexing & chained methods:
- Extract the column 'Sport'.
- Use .nunique() to get the number of unique elements in each group;
- Apply .sort_values(ascending=False) to rearrange the Series.
- Print the final Series Nsports. This has been done for you, so hit 'Submit Answer' to see the result!